from mcrcon import MCRcon


# Берём данные
def start():
    print('███╗░░░███╗██╗███╗░░██╗███████╗░█████╗░██████╗░░█████╗░███████╗████████╗\n'
            '████╗░████║██║████╗░██║██╔════╝██╔══██╗██╔══██╗██╔══██╗██╔════╝╚══██╔══╝\n'
            '██╔████╔██║██║██╔██╗██║█████╗░░██║░░╚═╝██████╔╝███████║█████╗░░░░░██║░░░\n'
            '██║╚██╔╝██║██║██║╚████║██╔══╝░░██║░░██╗██╔══██╗██╔══██║██╔══╝░░░░░██║░░░\n'
            '██║░╚═╝░██║██║██║░╚███║███████╗╚█████╔╝██║░░██║██║░░██║██║░░░░░░░░██║░░░\n'
            '╚═╝░░░░░╚═╝╚═╝╚═╝░░╚══╝╚══════╝░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░░░░╚═╝░░░\n\n'
            '░██████╗███████╗██████╗░██╗░░░██╗███████╗██████╗░\n'
            '██╔════╝██╔════╝██╔══██╗██║░░░██║██╔════╝██╔══██╗\n'
            '╚█████╗░█████╗░░██████╔╝╚██╗░██╔╝█████╗░░██████╔╝\n'
            '░╚═══██╗██╔══╝░░██╔══██╗░╚████╔╝░██╔══╝░░██╔══██╗\n'
            '██████╔╝███████╗██║░░██║░░╚██╔╝░░███████╗██║░░██║\n'
            '╚═════╝░╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚══════╝╚═╝░░╚═╝\n\n'
            '░█████╗░░█████╗░███╗░░██╗████████╗██████╗░░█████╗░██╗░░░░░██╗░░░░░███████╗██████╗░\n'
            '██╔══██╗██╔══██╗████╗░██║╚══██╔══╝██╔══██╗██╔══██╗██║░░░░░██║░░░░░██╔════╝██╔══██╗\n'
            '██║░░╚═╝██║░░██║██╔██╗██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░█████╗░░██████╔╝\n'
            '██║░░██╗██║░░██║██║╚████║░░░██║░░░██╔══██╗██║░░██║██║░░░░░██║░░░░░██╔══╝░░██╔══██╗\n'
            '╚█████╔╝╚█████╔╝██║░╚███║░░░██║░░░██║░░██║╚█████╔╝███████╗███████╗███████╗██║░░██║\n'
            '╚════╝░░╚════╝░╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝░╚════╝░╚══════╝╚══════╝╚══════╝╚═╝░░╚═╝\n\n')
    ip = input('Введите IP-адресс сервера: ')
    rcon_port = input('Введите RCON-порт сервера: ')
    rcon_pas = input('Введите RCON-пароль сервера: ')
    connect(ip, rcon_port, rcon_pas)


# Подключаемся
def connect(ip, port, pas):
    print('[LOG] Подключение.')
    # Пробуем подключится
    try:
        mcr = MCRcon(ip, pas, int(port))
        mcr.connect()
    # Если, неверные данные, не существующий сервер, выключен RCON, выводим ошибку
    except OSError:
        print('Произошла ошибка. '
              'Удостоверьтесь в правильностим введёных Вами данными и повторите попытку. '
              'Если данные верны, то проблема в выключенном RCON.')
    # Если, в порту присутствуют буквы, выводим ошибку
    except ValueError:
        print('Произошла ошибка. RCON-порт не может принимать буквенные значения.')
    # Подключаемся
    else:
        print('[LOG] Подключено.')
        print('[LOG] Ввод команд производится без знака "/".')
        while True:
            command = input()
            resp = mcr.command(command)
            print('[Сервер] ' + resp)


if __name__ == '__main__':
    start()
