from mcrcon import MCRcon


def start():
    print('███╗░░░███╗██╗███╗░░██╗███████╗░█████╗░██████╗░░█████╗░███████╗████████╗\n'
            '████╗░████║██║████╗░██║██╔════╝██╔══██╗██╔══██╗██╔══██╗██╔════╝╚══██╔══╝\n'
            '██╔████╔██║██║██╔██╗██║█████╗░░██║░░╚═╝██████╔╝███████║█████╗░░░░░██║░░░\n'
            '██║╚██╔╝██║██║██║╚████║██╔══╝░░██║░░██╗██╔══██╗██╔══██║██╔══╝░░░░░██║░░░\n'
            '██║░╚═╝░██║██║██║░╚███║███████╗╚█████╔╝██║░░██║██║░░██║██║░░░░░░░░██║░░░\n'
            '╚═╝░░░░░╚═╝╚═╝╚═╝░░╚══╝╚══════╝░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░░░░░░░╚═╝░░░\n\n'
            '░██████╗███████╗██████╗░██╗░░░██╗███████╗██████╗░\n'
            '██╔════╝██╔════╝██╔══██╗██║░░░██║██╔════╝██╔══██╗\n'
            '╚█████╗░█████╗░░██████╔╝╚██╗░██╔╝█████╗░░██████╔╝\n'
            '░╚═══██╗██╔══╝░░██╔══██╗░╚████╔╝░██╔══╝░░██╔══██╗\n'
            '██████╔╝███████╗██║░░██║░░╚██╔╝░░███████╗██║░░██║\n'
            '╚═════╝░╚══════╝╚═╝░░╚═╝░░░╚═╝░░░╚══════╝╚═╝░░╚═╝\n\n'
            '░█████╗░░█████╗░███╗░░██╗████████╗██████╗░░█████╗░██╗░░░░░██╗░░░░░███████╗██████╗░\n'
            '██╔══██╗██╔══██╗████╗░██║╚══██╔══╝██╔══██╗██╔══██╗██║░░░░░██║░░░░░██╔════╝██╔══██╗\n'
            '██║░░╚═╝██║░░██║██╔██╗██║░░░██║░░░██████╔╝██║░░██║██║░░░░░██║░░░░░█████╗░░██████╔╝\n'
            '██║░░██╗██║░░██║██║╚████║░░░██║░░░██╔══██╗██║░░██║██║░░░░░██║░░░░░██╔══╝░░██╔══██╗\n'
            '╚█████╔╝╚█████╔╝██║░╚███║░░░██║░░░██║░░██║╚█████╔╝███████╗███████╗███████╗██║░░██║\n'
            '╚════╝░░╚════╝░╚═╝░░╚══╝░░░╚═╝░░░╚═╝░░╚═╝░╚════╝░╚══════╝╚══════╝╚══════╝╚═╝░░╚═╝\n\n')
    ip = input("[RCON] Пожалуйста, введите IP-адрес RCON-сервера: ")
    rcon_port = input("[RCON] Пожалуйста, введите порт RCON-сервера: ")
    rcon_password = input("[RCON] Пожалуйста, введите пароль RCON-сервера: ")
    connect(ip, rcon_port, rcon_password)


def connect(ip, port, password):
    print("[RCON] Идёт подключение...")
    try:
        mcr = MCRcon(ip, password, int(port))
        mcr.connect()
    except OSError:
        print("[RCON] Произошла ошибка при подключении. Пожалуйста, проверьте "
             "правильность введённых данных, а также работу RCON-сервера.")
        start()
    except ValueError:
        print("[RCON] RCON-пароль не должен содержать символы. [См. https://github.com/itsSourCream/minecraft-server-controller/issues/3]")
        start()

    else:
        print("[RCON] Подключение к серверу успешно.")
        print("[RCON] Ввод команд производится без '/'.")
        while True:
            command = input("[<=] ")
            resp = mcr.command(command)
            print("[=>] " + resp)


if __name__ == "__main__":
    start()
